GlitchText.prototype.glitch_dullness = function(str){
    var dic = {
        か : 'が',
        き : 'ぎ',
        く : 'ぐ',
        け : 'げ',
        こ : 'ご',
        さ : 'ざ',
        し : 'じ',
        す : 'ず',
        せ : 'ぜ',
        そ : 'ぞ',
        た : 'だ',
        ち : 'ぢ',
        つ : 'づ',
        て : 'で',
        と : 'ど',
        は : 'ぱ',
        ひ : 'ぴ',
        ふ : 'ぷ',
        へ : 'ぺ',
        ほ : 'ぽ',
        カ : 'ガ',
        キ : 'ギ',
        ク : 'グ',
        ケ : 'ゲ',
        コ : 'ゴ',
        サ : 'ザ',
        シ : 'ジ',
        ス : 'ズ',
        セ : 'ゼ',
        ソ : 'ゾ',
        タ : 'ダ',
        チ : 'ヂ',
        ツ : 'ヅ',
        テ : 'デ',
        ト : 'ド',
        ハ : 'バ',
        ヒ : 'ビ',
        フ : 'ブ',
        ヘ : 'ベ',
        ホ : 'ボ'
    };
    str = str.split('');
    for(k in dic){
        str = str.map(function(c){
            if(c == k) return dic[k];
            return c;
        });
    };
    return str.join('');
};
